In [2]:
# Pandas
import pandas as pd

# SQL Alchemy
from sqlalchemy import create_engine

# PyMySQL 
import pymysql
pymysql.install_as_MySQLdb()

In [3]:
# Create Engine and Pass in MySQL Connection
engine = create_engine("mysql://root:RoyalJay7106#@localhost/sakila")
conn = engine.connect()

In [4]:
#COMPLETE 1a. Display the first and last names of all actors from the table actor.
#Select first_name, last_name, Actor_Name from actor;

sakila1a = pd.read_sql("SELECT first_name, last_name, Actor_Name FROM actor", conn)
sakila1a.head()

  first_name     last_name           Actor_Name
0   PENELOPE       GUINESS     PENELOPE,GUINESS
1       NICK      WAHLBERG        NICK,WAHLBERG
2         ED         CHASE             ED,CHASE
3   JENNIFER         DAVIS       JENNIFER,DAVIS
4     JOHNNY  LOLLOBRIGIDA  JOHNNY,LOLLOBRIGIDA

In [5]:
#COMPLETE 2a. You need to find the ID number, first name, and last name of an actor, of whom you know only the first name, "Joe." What is one query would you use to obtain this information?
#Select actor_id, first_name, last_name from actor where first_name = 'Joe';
sakila2a = pd.read_sql("Select actor_id, first_name, last_name from actor where first_name = 'Joe'", conn)
sakila2a.head()

   actor_id first_name last_name
0         9        JOE     SWANK

In [8]:
#7e. Display the most frequently rented movies in descending order.
#Select c.title, count(a.inventory_id) as 'Rental_Count' from rental a, inventory b, film c
#where a.inventory_id = b.inventory_id and b.film_id = c.film_id and a.inventory_id = '1'
#group by c.title
#order by count(a.inventory_id) desc;

sakila7e = pd.read_sql("Select c.title, count(a.inventory_id) as 'Rental_Count' from rental a, inventory b, film c where a.inventory_id = b.inventory_id and b.film_id = c.film_id group by c.title order by count(a.inventory_id) desc", conn)
sakila7e.head()

                 title  Rental_Count
0   BUCKET BROTHERHOOD            34
1     ROCKETEER MOTHER            33
2       GRIT CLOCKWORK            32
3       FORWARD TEMPLE            32
4  RIDGEMONT SUBMARINE            32